Revit 2024 API
ParameterTypeId.SteelElemWeldMainWeldprep Property
 "Main Weld preparation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemWeldMainWeldprep { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemWeldMainWeldprep As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemWeldMainWeldprep {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace